<meta charset="UTF-8">
<?php

//-----1.1
//$a = 3;
//$b = $a;
//echo $b;


//-----1.2
//$a=10;
//$b=2;
//
//$a1=(($a+$b)/6);
//$a2=(($a-$b)/6);
//$a3=(($a*$b)/6);
//$a4=(($a/$b)/6);
//echo "1 = $a1, 2 = $a2, 3 = $a3, 4 = $a4";


//-----1.3
//$c = 15;
//$d = 2;
//$result = $c + $d;
//
//echo "result = $result";


//-----1.4
//$a = 10;
//$b = 2;
//$c = 5;
//
//$nums = array(10,2,5);
//echo (($a+$b+$c)/(array_sum($nums)/count($nums)));

//-----1.5
//$a = 17;
//$b = 10;
//
//$c = $a - $b;
//$d = 17;
//$result = $c + $d;
//
//echo "result = $result";

//-----2.1
//$text = 'Привет, Мир!';
//echo "$text Моя первая программа!";

//-----2.2
//$text1='Привет, ';
//$text2='Мир!';
//
//echo $text1,$text2;

//-----2.3
//$name = ' Shit';
//echo "Привет, $name!";

//-----2.4
//$age = 44;
//$height = 180;
//echo "Мой рост: $height | Мой возраст: $age";

//-----2.5
//$text = 'abcde';
//echo $text[0], $text[2], $text[4];

//-----3.1
//$arr = ['a', 'b', 'c'];
//var_dump($arr, $arr[0],$arr[1],$arr[2]);

//-----3.2
//$arr = ['a', 'b', 'c'];
//echo ($arr[0].$arr[1].$arr[2]);

//-----3.3
//$arr = ['a', 'b', 'c', 'd'];
//echo "$arr[0] + $arr[1], $arr[2] + $arr[3], $arr[0] - $arr[3], $arr[0] / $arr[3]";

//-----3.4
//$arr = [2,5,3,9];
//$result = (($arr[0]*$arr[1])+($arr[2]*$arr[3]));
//echo $result;

//-----3.5
//foreach (range(1, 5) as $arr) {
//    echo $arr;
//}

//-----4.1
//$arr = ['a'=>11, 'b'=>20, 'c'=>30];
//echo $arr[c], ($arr[a]+$arr[b]+$arr[c]);

//-----4.2
//$arr = ['q3'=>12, 'r3'=>23, 'f3'=>34];
//echo $arr[q3]+$arr[r3]+$arr[f3];


//-----4.3
//$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
//echo "Петя = $arr[Петя], Коля = $arr[Коля]";

//-----4.4
//$arr = ['1'=>'Январь','2'=>'Февраль','3'=>'Март','4'=>'Апрель','5'=>'Май','6'=>'Июнь','7'=>'Июль','8'=>'Август', '9'=>'Сентябрь','10'=>'Октябрь','11'=>'Ноябрь','12'=>'Декабрь'];
//echo "Первый - $arr[9], последний - $arr[5]";

//-----4.5
//$arr = ['1'=>'пн','2'=>'вт','3'=>'ср','4'=>'чт','5'=>'пт','6'=>'сб','7'=>'вс'];
//$day = 3;
//
//echo($arr[$day]);


